#include <iostream> //включение директивы препроцессора для использования потоков (ввода/вывода)
using namespace std; //определение стандартного пространства имен

int main(void) //главная функция
{
double a,b;	//объявление переменных с двойной точностью
int Lofolop3; //объявление целочисленной переменной
setlocale(LC_ALL, "russian");//локализация консоли
//Вывод сообщений для диалога с пользователем, интерфейс, ввод значений:
cout << "--------------------------------------\n";
cout << "Введите первое число: ";
cin >> a;
cout << "\nВведите второе число: ";
cin >> b;
cout << "\n--------------------------------------\n";
cout << "Введите число, чтобы выполнить действие:\n";
cout << "1 - сложение\n";
cout << "2 - вычитание\n";
cout << "3 - умножение\n";
cout << "4 - деление\n";
cout << "--------------------------------------\n";
cin >> Lofolop3;
cout << "\n--------------------------------------\n";
//Используем оператор switch:
switch(Lofolop3)
{
	case 1:
		cout << "сложение: " << a <<" + "<< b <<" = " << (a+b) << endl;
		break;
	case 2:
		cout << "вычитание: " << a <<" - "<< b <<" = " << (a-b) << endl;
		break;
	case 3:
		cout << "умножение: " << a <<" * "<< b <<" = " << (a*b) << endl;
		break;
	case 4:
		cout << "деление: " << a <<" / "<< b <<" = " << (a/b) << endl;
		break;
	default:
		cout << "Упс, ошибочка" << endl;
		break;


}
cout << "--------------------------------------\n";


return 0;
}